; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Description
;;; ------------
;;; A manipulator works in an environment in
;;; which...
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain MANIPULATOR)
  (:requirements :strips :typing)
  (:types block				;This is the object that is supposed to be manipulated
	  door				;This can be opened or closed
	  location			;Location at which obstruction is safe
  )

  (:predicates (m-at ?l - location)
	       (b-at ?b - block ?l - location)
	       (d-at ?d - door ?l1 ?l2 - location)
	       (adjacent ?l1 ?l2 - location)
 	       (holding ?b - block)
	       (on ?b1 ?b2 - block)
	       (onground ?b - block)
	       (clear ?b - block)
	       (empty ?l - location)
	       (free-grippers)
  )

  (:action move
	     :parameters (?from ?to - location)
	     :precondition 
		(and (m-at ?from)
		(adjacent ?from ?to))
	     :effect
		(and (m-at ?to)
		(not(m-at ?from)))
  )


  (:action place
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(empty ?l)
		(holding ?b))
	     :effect
	        (and (free-grippers)
		(not(holding ?b))
		(b-at ?b ?l)
		(clear ?b)
		(not(empty ?l))
		(onground ?b))
  )


  (:action stack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?bbottom ?l)
		(clear ?bbottom)
		(holding ?btop))
	     :effect
	        (and (free-grippers)
		(not(holding ?btop))
		(b-at ?btop ?l)
		(on ?btop ?bbottom)
		(not(clear ?bbottom))
		(clear ?btop))
  )


  (:action pickup
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?b ?l)
		(onground ?b)
		(clear ?b)
		(free-grippers))
	     :effect
		(and (holding ?b)
		(not(b-at ?b ?l))
		(not(free-grippers))
		(not(onground ?b))
		(empty ?l)
		(not(clear ?b)))
  )

  (:action destack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?btop ?l)
		(b-at ?bbottom ?l)
		(clear ?btop)
		(on ?btop ?bbottom)
		(free-grippers))
	     :effect
		(and (holding ?btop)
		(not(b-at ?btop ?l))
		(not(free-grippers))
		(not(on ?btop ?bbottom))
		(not(clear ?btop))
		(clear ?bbottom))
  )


  (:action open
	     :parameters (?d - door ?unlockable ?locked - location)
	     :precondition 
		(and (m-at ?unlockable)
		(d-at ?d ?unlockable ?locked)
		(free-grippers))
	     :effect
		(and (adjacent ?unlockable ?locked)
		(adjacent ?locked ?unlockable))
  )

)

; problem
(define (problem MANIPULATOR-1)

(:domain MANIPULATOR)
  (:objects
	D - door
	L1 L2 L3 L4 - location
	B1 B2 - block
  )

  (:init
	(m-at L3)
	(holding B1)
	(adjacent L1 L2)(adjacent L2 L1)
	(adjacent L2 L3)(adjacent L3 L2)
	(d-at D L3 L4)
	(empty L1)
	(empty L4)
	(b-at B2 L2)
	(onground B2)(clear B2)
  )

  (:goal 
	(b-at B2 L4)
  )
)

; plan
1. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 0 of 1
2. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 0 of 1
3. (place b1 l1)
   deleted: (holding b1) (empty l1)
   added: (free-grippers) (b-at b1 l1) (clear b1) (onground b1)
   goals met: 0 of 1
4. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 0 of 1
5. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 0 of 1
6. (open d l3 l4)
   added: (adjacent l3 l4) (adjacent l4 l3)
   goals met: 0 of 1
7. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 0 of 1
8. (pickup b2 l2)
   deleted: (b-at b2 l2) (free-grippers) (onground b2) (clear b2)
   added: (holding b2) (empty l2)
   goals met: 0 of 1
9. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 0 of 1
10. (move l3 l4)
   deleted: (m-at l3)
   added: (m-at l4)
   goals met: 0 of 1
11. (place b2 l4)
   deleted: (holding b2) (empty l4)
   added: (free-grippers) (b-at b2 l4) (clear b2) (onground b2)
   goals met: 1 of 1
